GitConverter/src/Catalogs/ХранилищаКонфигураций/ХранилищаКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищаКонфигураций</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРепозиторияGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйПроект</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияEDTCLI</name>
    <type>
      <types>CatalogRef.ВерсииEDT</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВGit</name>
    <type>
      <types>CatalogRef.ВерсииХранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьКоммиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьМеткиСВерсиейКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИспользованиеОбщихОчередей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроектаEDT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогДляАрхивацииОшибок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоммитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛокальныйКаталогGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоПодготавливаемыхВерсий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьЛогирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьКоммитыВРепозиторийGit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервераGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервераGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПомещатьАнонимноЕслиНеНайденПользователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХранилища</name>
    <type>
      <types>EnumRef.ТипыХранилищаКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбрабатыватьВсеОчереди</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьВременныеДанныеВерсииПослеКоммита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьКонфигурацииПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GitConverter/src/Catalogs/ХранилищаКонфигураций/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Адрес;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипХранилища) Тогда
		ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Конфигурация;
	КонецЕсли;
	
	// Создание регламентного задания (получение уникального идентификатора)
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗаданияСервер.Задание(ИдентификаторЗадания);
	Если Задание = Неопределено
		И ДополнительныеСвойства.Свойство("Использование")
		И ДополнительныеСвойства.Использование Тогда
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.КонвертацияХранилища);
		ПараметрыЗадания.Вставить("Использование", ИспользованиеЗадания);
		ПараметрыЗадания.Вставить("Расписание", Новый РасписаниеРегламентногоЗадания);
		ПараметрыЗадания.Вставить("Наименование", НСтр("ru = 'Конвертация хранилища'") + ": " + СокрЛП(Адрес));
		Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		
		ИдентификаторЗадания = РегламентныеЗаданияСервер.УникальныйИдентификатор(Задание);
		
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		ИспользованиеЗадания = Ложь;
	ИначеЕсли ДополнительныеСвойства.Свойство("Использование") Тогда
		ИспользованиеЗадания = ДополнительныеСвойства.Использование;
	Иначе
		ИспользованиеЗадания = Задание.Использование;
	КонецЕсли;
	
	Если Не ИспользованиеЗадания Тогда
		ПредставлениеРасписания = "";
	ИначеЕсли ДополнительныеСвойства.Свойство("Расписание") Тогда
		ПредставлениеРасписания = Строка(ДополнительныеСвойства.Расписание);
	Иначе
		ПредставлениеРасписания = Строка(Задание.Расписание);
	КонецЕсли;
	
	Адрес = СокрЛП(Адрес);
	ВерсияПлатформыХранилища = СокрЛП(ВерсияПлатформыХранилища);
	ВерсияПлатформы = СокрЛП(ВерсияПлатформы);
	ИмяРасширения = СокрЛП(ИмяРасширения);
	ИмяПользователяХранилища = СокрЛП(ИмяПользователяХранилища);
	ИмяПользователяХранилища =СокрЛП(ИмяПользователяХранилища);
	КаталогВыгрузкиВерсий = ОбщегоНазначения.ПолноеИмяКаталога(КаталогВыгрузкиВерсий, Истина, Ложь);
	ЛокальныйКаталогGit = СокрЛП(ЛокальныйКаталогGit);
	ИмяВетки = СокрЛП(ИмяВетки);
	АдресРепозиторияGit = СокрЛП(АдресРепозиторияGit);
	ПользовательСервераGit = СокрЛП(ПользовательСервераGit);
	ИмяПроектаEDT = ОбщегоНазначения.УдалитьКонечныйРазделительПути(СокрЛП(ИмяПроектаEDT));
	
	ДополнительныеСвойства.Вставить("Задание",Задание);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Задание") Тогда
		Задание = ДополнительныеСвойства.Задание;
		Если Задание = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура;
	
	// Расписание устанавливается в форме элемента
	Если ДополнительныеСвойства.Свойство("Расписание") 
			И ТипЗнч(ДополнительныеСвойства.Расписание) = Тип("РасписаниеРегламентногоЗадания")
			И Строка(ДополнительныеСвойства.Расписание) <> Строка(Задание.Расписание) Тогда
		ПараметрыЗадания.Вставить("Расписание", ДополнительныеСвойства.Расписание);
	КонецЕсли;
	
	// Использование устанавливается в форме элемента
	Если ПометкаУдаления И Задание.Использование Тогда
		
		ПараметрыЗадания.Вставить("Использование", Ложь);
		
	ИначеЕсли ДополнительныеСвойства.Свойство("Использование") 
			И ДополнительныеСвойства.Использование <> Задание.Использование Тогда
		
		ПараметрыЗадания.Вставить("Использование", ДополнительныеСвойства.Использование);
		
	КонецЕсли;
	НаименованиеЗадания = НСтр("ru = 'Конвертация хранилища'") + ": ";
	
	НаименованиеЗадания = НаименованиеЗадания + СокрЛП(Адрес);
	ПараметрыЗадания.Вставить("Наименование", НаименованиеЗадания);
	ПараметрыЗадания.Вставить("Ключ", Строка(Ссылка.УникальныйИдентификатор()));
	
	Если Задание.Параметры.Количество() <> 1 ИЛИ Задание.Параметры[0] <> Ссылка Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Ссылка);
		ПараметрыЗадания.Вставить("Параметры", МассивПараметров);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РегламентныеЗаданияСервер.ИзменитьЗадание(ИдентификаторЗадания, ПараметрыЗадания);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторЗадания = Неопределено;
	ВерсияВGit = Неопределено;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегламентныеЗаданияСервер.УдалитьЗадание(ИдентификаторЗадания);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНеПроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(АдресРепозиторияGit) ИЛИ НЕ ОбщегоНазначенияКлиентСервер.ЭтоHTTPАдрес(АдресРепозиторияGit) Тогда
	
		МассивНеПроверяемыхРеквизитов.Добавить("ПользовательСервераGit");
		МассивНеПроверяемыхРеквизитов.Добавить("ПарольСервераGit");
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВерсияПлатформы) Тогда
		Сегменты = СтрРазделить(ВерсияПлатформы, ".");
		
		Если Сегменты.Количество() <> 4 Тогда
			Сообщение = Новый СообщениеПользователю();;
			Сообщение.Текст = НСтр("ru = 'Версия должна быть в формате Х.Х.Х.Х'");
			Сообщение.Поле = "ВерсияПлатформыХранилища";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Конфигурация Тогда
		МассивНеПроверяемыхРеквизитов.Добавить("БазовыйПроект");
		МассивНеПроверяемыхРеквизитов.Добавить("ИмяРасширения");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНеПроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
